hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_pwm.h
    When the sequence is set (by a call to @ref nrf_pwm_sequence_set), the
    provided duty cycle values are not copied. The @p values pointer is stored
    in the peripheral's internal register, and the values are loaded from RAM
    during the sequence playback. Therefore, you must ensure that the values
    do not change before and during the sequence playback (for example,
    the values cannot be placed in a local variable that is allocated on stack).
    If the sequence is played in a loop and the values should be updated
    before the next iteration, it is safe to modify them when the corresponding
    event signaling the end of sequence occurs (@ref NRF_PWM_EVENT_SEQEND0
    or @ref NRF_PWM_EVENT_SEQEND1, respectively).

    @note The @p repeats and @p end_delay values (which are written to the
         SEQ[n].REFRESH and SEQ[n].ENDDELAY registers in the peripheral,
         respectively) are ignored at the end of a complex sequence
         playback, indicated by the LOOPSDONE event.
         See the @linkProductSpecification52 for more information.
*/
typedef struct
{
    nrf_pwm_values_t values; ///< Pointer to an array with duty cycle values. This array must be in Data RAM.
    /** < This field is defined as an union of pointers
         to provide a convenient way to define duty
         cycle values in various loading modes
         (see @ref nrf_pwm_dec_load_t).
         In each value, the most significant bit (15)
         determines the polarity of the output and the
         others (14-0) compose the 15-bit value to be
         compared with the pulse generator counter. */
    uint16_t length;    ///< Number of 16-bit values in the array pointed by @p values.
    uint32_t repeats;   ///< Number of times that each duty cycle should be repeated (after being played once). Ignored in @ref NRF_PWM_STEP_TRIGGERED mode.
    uint32_t end_delay; ///< Additional time (in PWM periods) that the last duty cycle is to be kept after the sequence is played. Ignored in @ref NRF_PWM_STEP_TRIGGERED mode.
} nrf_pwm_sequence_t;

/**
    @brief Helper macro for calculating the number of 16-bit values in specified
          array of duty cycle values.
*/
#define NRF_PWM_VALUES_LENGTH(array)  (sizeof(array) / sizeof(uint16_t))


/**
    @brief Function for activating a specific PWM task.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] task  Task to activate.
*/
__STATIC_INLINE void nrf_pwm_task_trigger(NRF_PWM_Type *p_reg,
                                          nrf_pwm_task_t task);
                                          
/**
    @brief Function for getting the address of a specific PWM task register.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] task  Requested task.

    @return Address of the specified task register.
*/
__STATIC_INLINE uint32_t nrf_pwm_task_address_get(NRF_PWM_Type const *p_reg,
                                                  nrf_pwm_task_t task);
                                                  
/**
    @brief Function for clearing a specific PWM event.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] event Event to clear.
*/
__STATIC_INLINE void nrf_pwm_event_clear(NRF_PWM_Type *p_reg,
                                         nrf_pwm_event_t event);
                                         
/**
    @brief Function for checking the state of a specific PWM event.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] event Event to check.

    @retval true  If the event is set.
    @retval false If the event is not set.
*/
__STATIC_INLINE bool nrf_pwm_event_check(NRF_PWM_Type const *p_reg,
                                         nrf_pwm_event_t event);
                                         
/**
    @brief Function for getting the address of a specific PWM event register.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] event Requested event.

    @return Address of the specified event register.
*/
__STATIC_INLINE uint32_t nrf_pwm_event_address_get(NRF_PWM_Type const *p_reg,
                                                   nrf_pwm_event_t event);
                                                   
/**
    @brief Function for enabling specified shortcuts.

    @param[in] p_reg           Pointer to the peripheral registers structure.
    @param[in] pwm_shorts_mask Shortcuts to enable.
*/
__STATIC_INLINE void nrf_pwm_shorts_enable(NRF_PWM_Type *p_reg,
                                           uint32_t pwm_shorts_mask);
                                           
/**
    @brief Function for disabling specified shortcuts.

    @param[in] p_reg           Pointer to the peripheral registers structure.
    @param[in] pwm_shorts_mask Shortcuts to disable.
*/
__STATIC_INLINE void nrf_pwm_shorts_disable(NRF_PWM_Type *p_reg,
                                            uint32_t pwm_shorts_mask);
                                            
/**
    @brief Function for setting the configuration of PWM shortcuts.

    @param[in] p_reg           Pointer to the peripheral registers structure.
    @param[in] pwm_shorts_mask Shortcuts configuration to set.
*/
__STATIC_INLINE void nrf_pwm_shorts_set(NRF_PWM_Type *p_reg,
                                        uint32_t pwm_shorts_mask);
                                        
/**
    @brief Function for enabling specified interrupts.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] pwm_int_mask Interrupts to enable.
*/
__STATIC_INLINE void nrf_pwm_int_enable(NRF_PWM_Type *p_reg,
                                        uint32_t pwm_int_mask);
                                        
/**
    @brief Function for disabling specified interrupts.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] pwm_int_mask Interrupts to disable.
*/
__STATIC_INLINE void nrf_pwm_int_disable(NRF_PWM_Type *p_reg,
                                         uint32_t pwm_int_mask);
                                         
/**
    @brief Function for setting the configuration of PWM interrupts.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] pwm_int_mask Interrupts configuration to set.
*/
__STATIC_INLINE void nrf_pwm_int_set(NRF_PWM_Type *p_reg,
                                     uint32_t pwm_int_mask);
                                     
/**
    @brief Function for retrieving the state of a given interrupt.

    @param[in] p_reg   Pointer to the peripheral registers structure.
    @param[in] pwm_int Interrupt to check.

    @retval true  If the interrupt is enabled.
    @retval false If the interrupt is not enabled.
*/
__STATIC_INLINE bool nrf_pwm_int_enable_check(NRF_PWM_Type const *p_reg,
                                              nrf_pwm_int_mask_t pwm_int);
                                              
/**
    @brief Function for enabling the PWM peripheral.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_pwm_enable(NRF_PWM_Type *p_reg);

/**
    @brief Function for disabling the PWM peripheral.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_pwm_disable(NRF_PWM_Type *p_reg);

/**
    @brief Function for assigning pins to PWM output channels.

