hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_pwm.h
    Usage of all PWM output channels is optional. If a given channel is not
    needed, pass the @ref NRF_PWM_PIN_NOT_CONNECTED value instead of its pin
    number.

    @param[in] p_reg    Pointer to the peripheral registers structure.
    @param[in] out_pins Array with pin numbers for individual PWM output channels.
*/
__STATIC_INLINE void nrf_pwm_pins_set(NRF_PWM_Type *p_reg,
                                      uint32_t out_pins[NRF_PWM_CHANNEL_COUNT]);
                                      
/**
    @brief Function for configuring the PWM peripheral.

    @param[in] p_reg      Pointer to the peripheral registers structure.
    @param[in] base_clock Base clock frequency.
    @param[in] mode       Operating mode of the pulse generator counter.
    @param[in] top_value  Value up to which the pulse generator counter counts.
*/
__STATIC_INLINE void nrf_pwm_configure(NRF_PWM_Type *p_reg,
                                       nrf_pwm_clk_t  base_clock,
                                       nrf_pwm_mode_t mode,
                                       uint16_t       top_value);
                                       
/**
    @brief Function for defining a sequence of PWM duty cycles.

    @param[in] p_reg  Pointer to the peripheral registers structure.
    @param[in] seq_id Identifier of the sequence (0 or 1).
    @param[in] p_seq  Pointer to the sequence definition.
*/
__STATIC_INLINE void nrf_pwm_sequence_set(NRF_PWM_Type *p_reg,
                                          uint8_t                    seq_id,
                                          nrf_pwm_sequence_t const *p_seq);
                                          
/**
    @brief Function for modifying the pointer to the duty cycle values
          in the specified sequence.

    @param[in] p_reg    Pointer to the peripheral registers structure.
    @param[in] seq_id   Identifier of the sequence (0 or 1).
    @param[in] p_values Pointer to an array with duty cycle values.
*/
__STATIC_INLINE void nrf_pwm_seq_ptr_set(NRF_PWM_Type *p_reg,
                                         uint8_t          seq_id,
                                         uint16_t const *p_values);
                                         
/**
    @brief Function for modifying the total number of duty cycle values
          in the specified sequence.

    @param[in] p_reg  Pointer to the peripheral registers structure.
    @param[in] seq_id Identifier of the sequence (0 or 1).
    @param[in] length Number of duty cycle values.
*/
__STATIC_INLINE void nrf_pwm_seq_cnt_set(NRF_PWM_Type *p_reg,
                                         uint8_t  seq_id,
                                         uint16_t length);
                                         
/**
    @brief Function for modifying the additional number of PWM periods spent
          on each duty cycle value in the specified sequence.

    @param[in] p_reg   Pointer to the peripheral registers structure.
    @param[in] seq_id  Identifier of the sequence (0 or 1).
    @param[in] refresh Number of additional PWM periods for each duty cycle value.
*/
__STATIC_INLINE void nrf_pwm_seq_refresh_set(NRF_PWM_Type *p_reg,
                                             uint8_t  seq_id,
                                             uint32_t refresh);
                                             
/**
    @brief Function for modifying the additional time added after the sequence
          is played.

    @param[in] p_reg     Pointer to the peripheral registers structure.
    @param[in] seq_id    Identifier of the sequence (0 or 1).
    @param[in] end_delay Number of PWM periods added at the end of the sequence.
*/
__STATIC_INLINE void nrf_pwm_seq_end_delay_set(NRF_PWM_Type *p_reg,
                                               uint8_t  seq_id,
                                               uint32_t end_delay);
                                               
/**
    @brief Function for setting the mode of loading sequence data from RAM
          and advancing the sequence.

    @param[in] p_reg    Pointer to the peripheral registers structure.
    @param[in] dec_load Mode of loading sequence data from RAM.
    @param[in] dec_step Mode of advancing the active sequence.
*/
__STATIC_INLINE void nrf_pwm_decoder_set(NRF_PWM_Type *p_reg,
                                         nrf_pwm_dec_load_t dec_load,
                                         nrf_pwm_dec_step_t dec_step);
                                         
/**
    @brief Function for setting the number of times the sequence playback
          should be performed.

    This function applies to two-sequence playback (concatenated sequence 0 and 1).
    A single sequence can be played back only once.

    @param[in] p_reg      Pointer to the peripheral registers structure.
    @param[in] loop_count Number of times to perform the sequence playback.
*/
__STATIC_INLINE void nrf_pwm_loop_set(NRF_PWM_Type *p_reg,
                                      uint16_t loop_count);
                                      
                                      
#ifndef SUPPRESS_INLINE_IMPLEMENTATION
                                      
__STATIC_INLINE void nrf_pwm_task_trigger(NRF_PWM_Type *p_reg,
                                          nrf_pwm_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

__STATIC_INLINE uint32_t nrf_pwm_task_address_get(NRF_PWM_Type const *p_reg,
                                                  nrf_pwm_task_t task)
{
    return ((uint32_t)p_reg + (uint32_t)task);
}

__STATIC_INLINE void nrf_pwm_event_clear(NRF_PWM_Type *p_reg,
                                         nrf_pwm_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
    #if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event));
    (void)dummy;
    #endif
}

__STATIC_INLINE bool nrf_pwm_event_check(NRF_PWM_Type const *p_reg,
                                         nrf_pwm_event_t event)
{
    return (bool) * (volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event);
}

